DrDennnis/esp32screen/src/main.cpp
#include <Arduino.h>
#include <EEPROM.h>
#include <AiEsp32RotaryEncoder.h>
#include <EMUSerial.h>
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include "option.h"
#include "OneButton.h"

#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#endif
#include <ESPmDNS.h>

#include <ESPAsyncWebServer.h>
#include <AsyncElegantOTA.h>


// SCREEN
#define TFT_MOSI 23  // SDA Pin on ESP32
#define TFT_SCLK 18  // SCL Pin on ESP32
#define TFT_CS   15  // Chip select control pin
#define TFT_DC    2  // Data Command control pin
#define TFT_RST   4  // Reset pin (could connect to RST pin)

//ROTARY  ENCODER
#define ROTARY_ENCODER_A_PIN 14
#define ROTARY_ENCODER_B_PIN 12
#define ROTARY_ENCODER_BUTTON_PIN 13
#define ROTARY_ENCODER_VCC_PIN -1
#define ROTARY_ENCODER_STEPS 4


uint16_t SCREEN_WIDTH = 240;
uint16_t SCREEN_HEIGHT = 320;

unsigned long previousScreenMillis = 0;
unsigned long previousMillis = 0;
const long screenRefreshRate = 12; // screen refresh rate
const long debounce = 10; 

int lastEncoderPos = 0;
int optionSelected = 0;
static unsigned long lastTimePressed = 0; // Soft debouncing
int buttonState = LOW;
int lastMenuState = LOW;
int menuState = LOW;
int lastSubMenuState = LOW;
int subMenuState = LOW;
int blockColor = ST77XX_WHITE;

bool intSuboptionSelected = false;
int selectedSubOption = 0;


const char* ssid = "EmuScreen";
const char* password = "12345678";
IPAddress local_ip(192,168,1,1);
IPAddress gateway(192,168,1,1);
IPAddress subnet(255,255,255,0);


// Initialize Adafruit ST7789 TFT library
Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);

// Initialize AiEsp32RotaryEncoder Library
AiEsp32RotaryEncoder rotaryEncoder = AiEsp32RotaryEncoder(ROTARY_ENCODER_A_PIN, ROTARY_ENCODER_B_PIN, -1, ROTARY_ENCODER_VCC_PIN, ROTARY_ENCODER_STEPS);


// Setup a new OneButton on pin A1.  
OneButton button1(ROTARY_ENCODER_BUTTON_PIN, true);

// PinButton myButton(ROTARY_ENCODER_BUTTON_PIN, INPUT);

EMUSerial emu(Serial1);

AsyncWebServer server(80);

bool updateMode = LOW;
bool updateScreen = LOW;


void emuRpm()
{
  tft.printf("%04d", emu.emu_data.RPM);
}

void emuBatt()
{
  float value = emu.emu_data.Batt;
  if (value < 10)
  {
    tft.print(0);
  }
  tft.printf("%.2fV", emu.emu_data.Batt);
}

void emuIat()
{
  tft.printf("%03dC", emu.emu_data.IAT);
}

void emuOilPresure()
{
  float value = emu.emu_data.oilPressure;
  if (value < 10)
  {
    tft.print(0);
  }
  tft.printf("%.2f", emu.emu_data.oilPressure);
}

void emuOilTemp()
{
  tft.printf("%03dC", emu.emu_data.oilTemperature);
}

void emuCoolantTemp()
{
  tft.printf("%03dC", emu.emu_data.CLT);
}

void emuAfr()
{
  float value = emu.emu_data.wboAFR;
  if (value < 10)
  {
    tft.print(0);
  }
  
  tft.printf("%.2f", emu.emu_data.wboAFR);
}

void noValidation()
{
  tft.setTextColor(ST77XX_GREEN, ST77XX_BLACK);
  blockColor = ST77XX_WHITE;
}

void validationBatt()
{
  if (emu.emu_data.Batt < 11.0)
  {
    tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
    blockColor = ST77XX_RED;
  }
}

void validationOilTemp()
{
  if (emu.emu_data.oilTemperature < 80)
  {
    tft.setTextColor(ST77XX_ORANGE, ST77XX_BLACK);
    blockColor = ST77XX_ORANGE;
  }
  
  if (emu.emu_data.oilTemperature > 120)
  {
    tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
    blockColor = ST77XX_RED;
  }
}

void validationOilPresure()
{
  if (emu.emu_data.oilPressure < 2.0)
  {
    tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
    blockColor = ST77XX_RED;
  }
}

void emptyCallBack(){}
void back()
{
  menuState = LOW;
  subMenuState = LOW;
}

// subOption subOpt1 = subOption("Position",1);
// subOption subOpt2 = subOption("Active",2);
int subOptionCount = 3;

subOption subOptions[] = {
  subOption("Active", {true, 0, info::subOptionType::Type_Bool}),
  subOption("FullWidth", {true, 1, info::subOptionType::Type_Bool}),
  subOption("Position", {true, 2, info::subOptionType::Type_Int}),
};
int noOptionCount = 0;
subOption noOptions[] = {
};

// option opt1 = option("Rpm", 1, emuRpm, noValidation, subOptions);
// option opt2 = option("Batt", 5, emuBatt, validationBatt);
// option opt3 = option("Iat", 10, emuIat, noValidation);
// option opt4 = option("Oil Temp", 15, emuOilTemp, validationOilTemp);
// option opt5 = option("Oil Press", 20, emuOilPresure, validationOilPresure);
// option opt6 = option("CL Temp", 25, emuCoolantTemp, noValidation);
// option opt7 = option("BACK", 250, back, emptyCallBack, false);

// // opt1.addSubOption(subOpt1);

// option options[] = {
//   opt1,
//   opt2,
//   opt3,
//   opt4,
//   opt5,
//   opt6,
//   opt7,
// };

option options[] = {
  option("Rpm", 0, emuRpm, noValidation, subOptions,subOptionCount),
  option("Batt", 35, emuBatt, validationBatt, subOptions, subOptionCount),
  option("IAT", 70, emuIat, noValidation, subOptions,subOptionCount),
  option("OilT", 105, emuOilTemp, validationOilTemp, subOptions,subOptionCount),
  option("OilP", 140, emuOilPresure, validationOilPresure, subOptions,subOptionCount),
  option("CLT", 175, emuCoolantTemp, noValidation, subOptions,subOptionCount),
  option("AFR", 200, emuAfr, noValidation, subOptions,subOptionCount),
};


bool comp(option& lhs, option& rhs)
{
  lhs.readMemoryData();
  rhs.readMemoryData();
  return lhs.position < rhs.position;
}

void sortOptions()
{
  std::sort(options, options + (sizeof(options) / sizeof(options[0])), comp);
}
 
void renderMainScreen() {
  tft.setTextWrap(false);
  tft.setCursor(0, 10);
  
  tft.setTextSize(3);
  
  int x = 2;
  int y = 0;
  int itemCount = 0;
  int blockHeight = 50;
  int textSizeTitle = 2;
  int textSizeValue = 3;

  for (int i=0; i < (sizeof(options) / sizeof(options[0])); i++) {
    option item = options[i];
    item.readMemoryData();
    bool active = false;
    bool fullWidth = false;
    subOption* subOptions = item.getSubOptions();
    for (int i=0; i < item.getSubOptionCount(); i++) {
      subOption subOption = subOptions[i];
      if (subOption.getName() == "Active")
      {
        active = item.readMemoryDataBool(subOption.getInfo().memoryAddressModifier);
      }
      if (subOption.getName() == "FullWidth")
      {
        fullWidth = item.readMemoryDataBool(subOption.getInfo().memoryAddressModifier);
      }
    }
    if (active)
    {
      itemCount++;
      if (itemCount > 1)
      {
        if ( itemCount % 2 == 0)
        {
          x = (SCREEN_WIDTH / 2) +2;
        } else {
          x = 2;
          y += blockHeight;
        }
      }
      int width = (SCREEN_WIDTH / 2);
      if (fullWidth)
      {
        width = SCREEN_WIDTH;
        if ( itemCount % 2 == 0)
        {
          x = 2;
          y += blockHeight;
          itemCount++;
        }
        
        itemCount++;
        blockHeight = 50;
        textSizeTitle = 2;
        textSizeValue = 4;
      } else {
        blockHeight = 50;
        textSizeTitle = 2;
        textSizeValue = 3;
      }
      
      item.validate();
      tft.drawRect(x, y, width - 2, (blockHeight - 2), blockColor);
      tft.setCursor(4 + x, 2 + y + (blockHeight - 16) - 6);

      tft.setTextSize(textSizeTitle);
      tft.setTextColor(blockColor, ST77XX_BLACK);
      tft.print(item.getName()); 
      
      if (fullWidth)
      {
        tft.setCursor(70, 3 + y);
      } else {
        tft.setCursor(4 + x, 3 + y);
      }
      tft.setTextSize(textSizeValue);
      item.getEmuDataT();
      tft.println();
    }
  }
}

void renderMenu()
{
  tft.setTextSize(3);
  tft.setCursor(0, 10);
  int len = sizeof(options)/sizeof(options[0]);
  std::sort(options, options + len, comp);
    for (int i=0; i < (sizeof(options) / sizeof(options[0])); i++) {
    option item = options[i];

    int16_t color = 0x52AA;
    if (i == lastEncoderPos)
    {
      color = 0x94F2;
    }
    
    bool active = false;
    subOption* subOptions = item.getSubOptions();
    for (int i=0; i < item.getSubOptionCount(); i++) {
      subOption subOption = subOptions[i];
      if (subOption.getName() == "Active")
      {
        active = item.readMemoryDataBool(subOption.getInfo().memoryAddressModifier);
      }
    }

    if (active)
    {
      tft.setTextColor(ST77XX_GREEN);
    } else {
      tft.setTextColor(ST77XX_RED);
    }
    int blockHeight = 28;
    tft.drawRect(1, (i*blockHeight), SCREEN_WIDTH - 2, (blockHeight - 2), color);
    tft.setCursor(4, 1+(i*blockHeight));

    tft.print(item.getName());
    tft.setCursor((SCREEN_WIDTH - (24*2)) - 2, 1+(i*blockHeight));
    tft.print(item.getPosition());
  }
}

void renderSubMenu()
{
  tft.setTextSize(3);
  tft.setCursor(0, 10);

  option item = options[optionSelected];
  tft.setTextColor(ST77XX_WHITE, ST77XX_BLACK);
  tft.print(item.getName());
  
  int yOffset = 40;
  int blockHeight = 50;
  if (item.hasSubOption())
  {
    subOption* subOptions = item.getSubOptions();
    for (int i=0; i < item.getSubOptionCount(); i++) {
      tft.setTextSize(3);
      subOption subOption = subOptions[i];
      int16_t color = 0x52AA;
      int subOptionPos = lastEncoderPos;
      if (intSuboptionSelected)
      {
        if (selectedSubOption == i)
        {
          color = ST77XX_GREEN;
        }
      } else {
        if (i == lastEncoderPos)
        {
          color = 0x94F2;
        }
      }
      
      
      tft.drawRect(2, yOffset + (i*blockHeight), SCREEN_WIDTH - 6, (blockHeight - 2), color);
      tft.setCursor(6, yOffset + 1+(i*blockHeight));
      tft.print(subOption.getName());

      tft.setCursor(6, yOffset + 25+(i*blockHeight));
      tft.setTextSize(2);
      if (subOption.getInfo().type == info::subOptionType::Type_Bool)
      {
        tft.print(item.readMemoryDataBool(subOption.getInfo().memoryAddressModifier) ? "True " : "False");
      }
      if (subOption.getInfo().type == info::subOptionType::Type_Int)
      {
        if(intSuboptionSelected)
        {
          tft.print(lastEncoderPos);
        } else {
          tft.print(item.readMemoryDataInt(subOption.getInfo().memoryAddressModifier));
        }
      }
    } 
  }
}

void renderUpdateScreen(){
  tft.setCursor(0, 10);
  tft.setTextSize(2);
  tft.println("Connect to:");
  tft.println(ssid);
  tft.println("With Password:");
  tft.println(password);
  tft.println("After go to url:");
  tft.printf("%s.local", ssid);
  tft.println();
}

bool debugIndicator = false;

void renderDebugInfo()
{
  tft.setCursor(0, 300);
  tft.setTextSize(2);
  if (debugIndicator)
  {
    tft.fillRect(SCREEN_WIDTH-2, SCREEN_HEIGHT-2, 2, 2, ST77XX_WHITE);
    debugIndicator = false;
  } else {
    tft.fillRect(SCREEN_WIDTH-2, SCREEN_HEIGHT-2, 2, 2, ST77XX_RED);
    debugIndicator = true;
  }
  
}


void rotary_loop() {
  lastEncoderPos = rotaryEncoder.readEncoder();
  if (rotaryEncoder.encoderChanged()) {
    Serial.print("SCROLLLL : ");
    Serial.println(rotaryEncoder.readEncoder());
    // if (rotaryEncoder.readEncoder() < lastEncoderPos)
    // {
    // } else {
    // }
    lastEncoderPos = rotaryEncoder.readEncoder();
    
  }
}

void IRAM_ATTR readEncoderISR()
{
    rotaryEncoder.readEncoder_ISR();
}


void click1() {
  if (intSuboptionSelected)
  {
    intSuboptionSelected = false;
    option item = options[optionSelected];
    subOption subOption = item.getSubOptions()[selectedSubOption];
    item.updateMemory(subOption.getInfo().memoryAddressModifier, lastEncoderPos);
    rotaryEncoder.setBoundaries(0, item.getSubOptionCount() - 1, false);
    rotaryEncoder.setEncoderValue(selectedSubOption);
    lastEncoderPos = rotaryEncoder.readEncoder();
    return;
  }
  
  if(menuState == LOW)
  {
    rotaryEncoder.setEncoderValue(0);
    menuState = HIGH;
  } else if(subMenuState == LOW) {
      option item = options[lastEncoderPos];
      optionSelected = lastEncoderPos;
      rotaryEncoder.setEncoderValue(0);
      lastEncoderPos = rotaryEncoder.readEncoder();
      subMenuState = HIGH;
  } else {
      option item = options[optionSelected];
      if (item.hasSubOption() && item.isInRange(lastEncoderPos +1))
      {
        subOption subOption = item.getSubOptions()[lastEncoderPos];
        Serial.print(subOption.getName());
        if ( subOption.getInfo().isUpdateMemory)
        {
          if (subOption.getInfo().type == info::subOptionType::Type_Bool)
          {
            item.updateMemory(subOption.getInfo().memoryAddressModifier, !item.readMemoryDataBool(subOption.getInfo().memoryAddressModifier));
          }
          if (subOption.getInfo().type == info::subOptionType::Type_Int)
          {
            intSuboptionSelected = true;
            selectedSubOption = lastEncoderPos;
            rotaryEncoder.setBoundaries(0, 20, false);
            rotaryEncoder.setEncoderValue(item.readMemoryDataInt(subOption.getInfo().memoryAddressModifier));
          }
          
        }
        
      }
      
  }
} // click1


// This function will be called when the button1 was pressed 2 times in a short timeframe.
void doubleclick1() {
  if (subMenuState == HIGH)
  {
      subMenuState = LOW;
  } else if (menuState == HIGH)
  {
      menuState = LOW;
  } else if(!updateScreen) {
    Serial.println("Wifi should be enabled for updating");
    updateScreen = HIGH;
    updateMode = HIGH;
    tft.fillScreen(ST77XX_BLACK);
  } else if (updateScreen)
  {
    ESP.restart();
  }
  
} // doubleclick1


// This function will be called once, when the button1 is pressed for a long time.
void longPressStart1() {
  Serial.println("Button 1 longPress start");
} // longPressStart1


// This function will be called often, while the button1 is pressed for a long time.
void longPress1() {
  Serial.println("Button 1 longPress...");
} // longPress1


// This function will be called once, when the button1 is released after beeing pressed for a long time.
void longPressStop1() {
  Serial.println("Button 1 longPress stop");
} // longPressStop1

ICACHE_RAM_ATTR void checkTicks()
{
  // include all buttons here to be checked
  button1.tick(); // just call tick() to check the state.
}

void enableHotspot () {
  WiFi.softAPConfig(local_ip, gateway, subnet);
  WiFi.softAP(ssid, password);

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->redirect("/update");
  });

  AsyncElegantOTA.begin(&server);    // Start ElegantOTA
  server.begin();
  MDNS.begin(ssid);
}


void setup(void) {
  pinMode(ROTARY_ENCODER_A_PIN, INPUT_PULLUP);
  pinMode(ROTARY_ENCODER_B_PIN, INPUT_PULLUP);
  Serial.begin(9600);

  tft.init(SCREEN_WIDTH, SCREEN_HEIGHT, SPI_MODE2);    // Init ST7789 display 135x240 pixel
  tft.setRotation(2);
  tft.fillScreen(ST77XX_BLACK);
  tft.invertDisplay(true);
  
  //we must initialize rotary encoder
  rotaryEncoder.begin();
  rotaryEncoder.setup(readEncoderISR);
  //set boundaries and if values should cycle or not
  //in this example we will set possible values between 0 and 1000;
  bool circleValues = true;
  rotaryEncoder.setBoundaries(0, (sizeof(options) / sizeof(options[0]) - 1), circleValues); //minValue, maxValue, circleValues true|false (when max go to min and vice versa)


  // encoder.setButtonHeldEnabled(true);
  // encoder.setDoubleClickEnabled(true);
  /*Rotary acceleration introduced 25.2.2021.
  * in case range to select is huge, for example - select a value between 0 and 1000 and we want 785
  * without accelerateion you need long time to get to that number
  * Using acceleration, faster you turn, faster will the value raise.
  * For fine tuning slow down.
  */
  rotaryEncoder.disableAcceleration(); //acceleration is now enabled by default - disable if you dont need it
  // rotaryEncoder.setAcceleration(0); //or set the value - larger number = more accelearation; 0 or 1 means disabled acceleration

  Serial1.begin(19200, SERIAL_8N1, 19, 21); //EMU Serial setup, 8 Data Bits 1 Stopbit, RX Pin, TX Pin
    
  EEPROM.begin(512);
  
  // pinMode(ROTARY_ENCODER_BUTTON_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(ROTARY_ENCODER_BUTTON_PIN), checkTicks, CHANGE);
  button1.attachClick(click1);
  button1.attachDoubleClick(doubleclick1);
  // button1.attachLongPressStart(longPressStart1);
  // button1.attachLongPressStop(longPressStop1);
  // button1.attachDuringLongPress(longPress1);
  sortOptions();
}


 
int maxCount = 13;
int currentCount = 0;

void loop()
{
	emu.checkEmuSerial();
  if (updateMode) {
    enableHotspot();
    updateMode = false;
  }

  unsigned long currentMillis = millis();
  if (currentMillis - previousScreenMillis >= screenRefreshRate) {
    previousScreenMillis = currentMillis;
    if (lastMenuState && !menuState)
    {
      tft.fillScreen(ST77XX_BLACK);
      lastMenuState = LOW;
      sortOptions();
    }

    if (lastSubMenuState && !subMenuState)
    {
      tft.fillScreen(ST77XX_BLACK);
      lastSubMenuState = LOW;
      rotaryEncoder.setBoundaries(0, (sizeof(options) / sizeof(options[0])), true);
      rotaryEncoder.setEncoderValue(optionSelected);
    }

    if (!lastMenuState && menuState)
    {
      lastMenuState = HIGH;
      rotaryEncoder.setBoundaries(0, (sizeof(options) / sizeof(options[0])), true);
      tft.fillScreen(ST77XX_BLACK);
    }
    
    if (!lastSubMenuState && subMenuState)
    {
      lastSubMenuState = HIGH;
      // selected
      
      option item = options[optionSelected];
      rotaryEncoder.setBoundaries(0, item.getSubOptionCount() - 1, false);
      tft.fillScreen(ST77XX_BLACK);
    }


    if (updateScreen) {
        renderUpdateScreen();
    } else if (menuState) {
      if (subMenuState)
      {
        renderSubMenu();
      } else {
        renderMenu();
      }
    } else {
      renderMainScreen();
    }
    renderDebugInfo();
    
  }

  if (currentMillis - previousMillis >= debounce) {
    previousMillis = currentMillis;
    button1.tick(); 
    rotary_loop();
  }
}
